
var introduction = 'ٱللَّهُ سبحانة وتعالى لا حصر لأسمائه وصفاته فقد كان رسول الله ﷺ يدعو فيقول: ((اللهم إني عبدك، ابن عبدك، ابن أمتك، ناصيتي بيديك، ماضٍ في حكمك، عدلٌ في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحداً من خلقك، أو استأثرت به في علم الغيب عندك..)). وروى البخاري ومسلم عن أبي هريرة رضي ٱللَّهُ عنه أن النبي ﷺ قال:((إنَ لله تسعة وتسعين اسماً، مائة إلا واحداً، من أحصاها دخل الجنة))، أي من حفظ هذه ال٩٩ دخل الجنة، وليس في الحديث حصر لجميع الأسماء.';

var allahNamesList = [
  {
    'name': 'ٱللَّهُ',
    'details' : 'هو الاسم الدال على الذات الجامعة لصفات الألوهية.',
  },
  {
    'name': 'الرّحمن',
    'details' : 'واسع الرحمة في خلقه مؤمنهم وكافرهم.',
  },
  {
    'name': 'الرّحيم',
    'details' : 'المعطي من الثواب أضعاف العمل.',
  },
  {
    'name': 'الملك',
    'details' : 'المتصرّف في ملكه كما يشاء.',
  },
  {
    'name': 'القدوس',
    'details' : 'المنزه عن كل وصف يدركه حسٌ أو خيال.',
  },
  {
    'name': 'السلام',
    'details' : 'السالم من العيوب والنقائص والناشر سلامته على خلقه.',
  },
  {
    'name' : 'المؤمن',
    'details' : 'المصدق نفسه وكتبه ورسله فيما يقولونه عنه.',
  },
  {
    'name' : 'المهيمن',
    'details' : 'المسيطر على كل شيء بكماله وقوته.',
  },
  {
    'name' : 'العزيز',
    'details' : 'الغالب الذي لا نظير له.',
  },
  {
    'name' : 'الجبار',
    'details' : 'المنفذ مشيئته على سبيل الإجبار والجبر.',
  },
  {
    'name' : 'المتكبّر',
    'details' : 'المتفرد بصفات العظمة والكبرياء.',
  },
  {
    'name' : 'الخالق',
    'details' : 'المبدع لخلقه بإرادته.',
  },
  {
    'name' : 'البارئ',
    'details' : 'المميِّز لخلقه بالصور المختلفة.',
  },
  {
    'name' : 'المصوّر',
    'details' : 'الذي أعطى لكل خلق صورة خاصة.',
  },
  {
    'name' : 'الغفّار',
    'details' : 'الذي يستر القبيح في الدنيا ويتجاوز عنه في الآخرة.',
  },
  {
    'name' : 'القهّار',
    'details' : 'الذي يقهر الجبابرة.',
  },
  {
    'name' : 'الوهّاب',
    'details' : 'المتفضّل بالعطايا.',
  },
  {
    'name' : 'الرّزاق',
    'details' : 'خالق الأرزاق والمتكفّل بإيصالها إلى خلقه.',
  },
  {
    'name' : 'الفتاح',
    'details' : 'الذي يفتح خزائن رحمته لعباده.',
  },
  {
    'name' : 'العليم',
    'details' : 'المحيط علمه بكل شيء.',
  },
  {
    'name' : 'القابض',
    'details' : 'قابض يده عمن يشاء.',
  },
  {
    'name' : 'الباسط',
    'details' : 'بأسراره ورزقه على من يشاء.',
  },
  {
    'name' : 'الخافض',
    'details' : 'الذي يخفض الكفار والأشقياء المتكبرين.',
  },
  {
    'name' : 'الرّافع',
    'details' : ' للأقدار بين أولياء الرجال، فهو يرفع عباده الطائعين بعبادتهم.',
  },
  {
    'name' : 'المعزّ',
    'details' : 'للمؤمنين بطاعته فيعطيهم القوة والغلبة والشدة لمن شاء.',
  },
  {
    'name' : 'المذل',
    'details' : 'للكافرين بعصيانهم.',
  },
  {
    'name' : 'السّميع',
    'details' : 'الذي لا يغيب عنه مسموع، ويحيط بجميع الأصوات الظاهرة والباطنة والخفية والجلية.',
  },
  {
    'name' : 'البصير',
    'details' : 'الذي يشاهد جميع الموجودات ويرى الأشياء كلها ظاهرها وباطنها.',
  },
  {
    'name' : 'الحكيم',
    'details' : 'الذي إليه ترجع الأمور والأحكام فيفصل بين الحق والباطل ولا راد لقضائه.',
  },
  {
    'name' : 'العدل',
    'details' : 'الذي ليس في ملكه خلل وهو الذي حرم الظلم على نفسه.',
  },
  {
    'name' : 'اللّطيفِ',
    'details' : ' البرّ الرفيق بعباده يرزق ويحسن إليهم.',
  },
  {
    'name' : 'الخبيرِ',
    'details' : 'العالم بكل شيء باطن أو ظاهر.',
  },
  {
    'name' : 'الحليمِ',
    'details' : 'الذي لا يعجل بالعقاب فهو يمهل ولا يهمل.',
  },
  {
    'name' : 'العظيمِ',
    'details' : 'الذي لا تصل العقول إلى كُنه ذاته.',
  },
  {
    'name' : 'الغفورِ',
    'details' : 'غافر الذنب وقابل التوب.',
  },
  {
    'name' : 'الشّكورِ',
    'details' : 'المنعم على عباده بالثواب، ويتقبّل أعمال عباده ويُضاعف أجرها.',
  },
  {
    'name' : 'العليِّ',
    'details' : 'الذي علا بذاته وصفاته عن مدارج الخلق.',
  },
  {
    'name' : 'الكبيرِ',
    'details' : 'المُنزه عن الأوهام فهو العظيم الذي ليس كمثله شيء.',
  },
  {
    'name' : 'الحفيظِ',
    'details' : 'حافظ الكون من الخلل.',
  },
  {
    'name' : 'المقيتِ',
    'details' : 'خالق الأقوات ومُقسمها والمتكفّل بإيصالها للمخلوقات.',
  },
  {
    'name' : 'الحسيبِ',
    'details' : 'الذي يكفي عباده حاجتهم.',
  },
  {
    'name' : 'الجليلِ',
    'details' : 'عظيم القدر بجلاله وكماله.',
  },
  {
    'name' : 'الكريمِ',
    'details' : 'الذي لا ينفذ عطاؤه.',
  },
  {
    'name' : 'الرّقيبِ',
    'details' : 'الملاحظ لما يرعاهم فهو المراقب لأحوال العباد ويعلم أقوالهم وأفعالهم.',
  },
  {
    'name' : 'المُجيبِ',
    'details' : 'الذي يجيب الداعي إذا دعاه والسائل إذا سأله.',
  },
  {
    'name' : 'الواسعِ',
    'details' : 'الذي وسع رزقه جميع خلقه.',
  },
  {
    'name' : 'الحكيمِ',
    'details' : 'المُنزه عن فعل ما لا ينبغي بجلاله وكماله، المحقق في تدبيره، اللطيف في تقديره.',
  },
  {
    'name' : 'الودودِ',
    'details' : ' المتحبب إلى خلقه محب لهم والمحبوب في قلوب أوليائه.',
  },
  {
    'name' : 'المجيدِ',
    'details' : 'الشريف في ذاته وأفعاله، والجزيل في عطائه.',
  },
  {
    'name' : 'الباعثِ',
    'details' : ' باعث الموتى للحساب.',
  },
  {
    'name' : 'الشّهيدِ',
    'details' : 'الحاضر الذي لا يغيب عنه شيء فهو العالم بالأمور ظاهرها وباطنها.',
  },
  {
    'name' : 'الحقِ',
    'details' : 'خالق كل شيء بحكمة.',
  },
  {
    'name' : 'الوكيلِ',
    'details' : ' الكفيل بالخلق القائم بأمورهم فهو الموكول إليه الأمور كلها.',
  },
  {
    'name' : 'القويِّ',
    'details' : 'الذي لا يعجزه شيء وصاحب القدرة التامة البالغة الكمال.',
  },
  {
    'name' : 'المتينِ',
    'details' : 'الذي لا يُغلب ولا يحتاج إلى مدد وعون في إمضاء حكمه.',
  },
  {
    'name' : 'الوليِّ',
    'details' : 'المحب لأوليائه الناصر لهم.',
  },
  {
    'name' : 'الحميدِ',
    'details' : 'المستحق للحمد والثناء.',
  },
  {
    'name' : 'المُبدئِ',
    'details' : 'الذي بدأ الخلق وأوجده من العدم.',
  },
  {
    'name' : 'المعيدِ',
    'details' : 'المعيدالذي يعيد الخلق إلى الموت.',
  },
  {
    'name' : 'المحييِ',
    'details' : 'الذي يحيي العظام وهي رميم.',
  },
  {
    'name' : 'المميتِ',
    'details' : 'الذي يميت الأجسام بنزع الأرواح منها.',
  },
  {
    'name' : 'الحيِّ',
    'details' : 'المتصف بالحياة الأبدية.',
  },
  {
    'name' : 'القيومِ',
    'details' : 'القائم بنفسه الغني عن غيره.',
  },
  {
    'name' : 'الواجدِ',
    'details' : ' الذي يجد كل ما يطلبه ويريده.',
  },
  {
    'name' : 'الماجدِ',
    'details' : 'كبير الإحسان والأفضال.',
  },
  {
    'name' : 'الواحدِ',
    'details' : 'المتفرد ذاتًا ووصفًا وأفعالًا.',
  },
  {
    'name' : 'الصّمدِ',
    'details' : 'المقصود بالحوائج، فهو المطاع الذي لا يقضى دونه أمر.',
  },
  {
    'name' : 'القادرِ',
    'details' : ' المتفرد باختراع الموجودات.',
  },
  {
    'name' : 'المقتدرِ',
    'details' : 'الذي يقدر على ما يشاء.',
  },
  {
    'name' : 'المؤخرِ',
    'details' : ' مؤخر الأعداء بالإبعاد.',
  },
  {
    'name' : 'الأولِ',
    'details' : 'السابق للأشياء.',
  },
  {
    'name' : 'الآخرِ',
    'details' : 'الباقي بعد فناء خلقه.',
  },
  {
    'name' : 'الظّاهرِ',
    'details' : ' بآياته وعلامات قدرته.',
  },
  {
    'name' : 'الباطنِ',
    'details' : 'المحتجب عن الأنظار والمطلع على الأسرار.',
  },
  {
    'name' : 'الواليِ',
    'details' : 'المالك للأشياء والمتصرف فيها كيف يشاء.',
  },
  {
    'name' : 'المتعالِِ',
    'details' : 'رفيع الدرجات ذو العرش المرتفع في كبريائه وعظمته.',
  },
  {
    'name' : 'البرِ',
    'details' : 'الذي يمنُّ على السائلين بحسن العطاء.',
  },
  {
    'name' : 'التّوابِ',
    'details' : 'يقبل التوبة من عباده ويعفو عن سيئاته.',
  },
  {
    'name' : 'المنتقمِ',
    'details' : 'الذي نخشى نقمته لقدرته وعظمته.',
  },
  {
    'name' : 'العفوِّ',
    'details' : 'الذي يمحو الذنوب ويتجاوز عن السيئات.',
  },
  {
    'name' : 'الرّؤوفِ',
    'details' : 'شديد الرحمة بعباده.',
  },
  {
    'name' : 'مالك المُلكِ',
    'details' : 'له التصرف المطلق وهو تعالى الذي ينفذ مشيئته في ملكه كيف يشاء وكما يشاء.',
  },
  {
    'name' : 'ذو الجلال والإكرامِ',
    'details' : 'المنفرد بصفات الجلال والكمال والعظمة المختص بالإكرام والكرامة.',
  },
  {
    'name' : 'المُقسطِ',
    'details' : 'القائم بالقسط والمقيم بالعدل.',
  },
  {
    'name' : 'الجامعِ',
    'details' : 'الذي جمع الكمالات كلها ذاتًا ووصفًا وفعلًا.',
  },
  {
    'name' : 'الغنيِ',
    'details' : 'الذي لا يحتاج إلى شيء.',
  },
  {
    'name' : 'المغنيِ',
    'details' : 'المعطي لمن يشاء من عباده.',
  },
  {
    'name' : 'المانعِ',
    'details' : 'الذي يمنع البلاء حفظًا وعناية، ويمنع العطاء عمن يشاء ابتلاء وحماية.',
  },
  {
    'name' : 'الضّارِ',
    'details' : 'هو المقدر للضر لمن يشاء.',
  },
  {
    'name' : 'النّافعِ',
    'details' : 'المقدر للنفع ومالكه.',
  },
  {
    'name' : 'النّورِ',
    'details' : ' الهادي الرشيد الذي أرشد ونور قلوب الصادقين بتوحيده.',
  },
  {
    'name' : 'الهاديِ',
    'details' : 'الذي أعطى كل شيء خلقه ثم هدى، المبين لطريق الحق.',
  },
  {
    'name' : 'البديعِ',
    'details' : 'الذي لا يماثله أحد في صفاته ولا في أفعاله ولا في أحكامه أو أي أمر من أموره.',
  },
  {
    'name' : 'الباقيِ',
    'details' : 'الدائم الوجود الموصوف بالبقاء.',
  },
  {
    'name' : 'ِالوارث',
    'details' : 'من له ما في السماوات والأرض، رب كل شيء ووارثه ورازقه وراحمه.',
  },
  {
    'name' : 'الرّشيدِ',
    'details' : 'المرشد لأهل الطاعة، فأرشد من شاء بإرشاده وأشقى من شاء بإبعاده.',
  },
  {
    'name' : 'الصّبورِ',
    'details' : 'الذي يمهل وينظر ولا يعجل ولا يعاجل ولا يسارع وينزل الأمر بقدر معلوم.',
  },
];