var aboBakrList = [
  {
    'name' : 'أبو بَكر الصّدِّيق عبد الله بن أبي قُحافة التَّيمي القُرَشيّ',
    'life' : '(50 ق هـ - 13هـ / 573م - 634م)',
    'death_place' : 'المسجد النبوي، إلى جانب الرسول محمد وعمر بن الخطاب، المدينة المنورة',
    'notes' : 'أولُ الخُلفاء الراشدين، وكان أول من أسلم من الرجال، رافق نبيّ الإسلام مُحمد بهجرته إلى المدينة المنورة، وكان وزيرهُ وصاحبهُ، وبويع أبو بكر بالخِلافة، فقام بإدارة شؤون الدولة الإسلامية من تعيين الولاة والقضاء وتسيير الجيوش، وفي بداية عهده ارتدت العديد من القبائل العربية عن الإسلام، فحاربها وأرسل لها الجيوش حتى خضعت الجزيرة العربية بأكملها للحُكم الإسلامي، وبعد أن انتهى من حروب الرِّدة، وجه أبو بكر الجيش الإسلامي لفتح بلاد الشَّام والعراق، ففتح مُعظم العراق و جزءًا كبيرًا من أرض الشَّام.',
  },
];

var omarList = [
  {
    'name' : 'أبو حفص عمر بن الخطاب العدوي القرشي',
    'life' : '(40 ق.هـ - 26 ذو الحجة 23 هـ / ما بين عاميّ 586 و590 - 7 نوفمبر 644م)',
    'death_place' : 'المسجد النبوي، إلى جانب الرسول محمد وأبي بكر الصديق، المدينة المنورة',
    'notes' : 'هو ثاني الخلفاء الراشدين، أمير المؤمنين المُلقب بالفاروق، في عهده بلغ الإسلام مبلغًا عظيمًا، وتوسع نطاق الدولة الإسلامية حتى شمل كامل العراق ومصر وليبيا والشام وفارس وخراسان وشرق الأناضول وجنوب أرمينية وسجستان، والقدس، وبهذا استوعبت الدولة الإسلامية كامل أراضي الإمبراطورية الفارسية الساسانية وحوالي ثلثيّ أراضي الإمبراطورية البيزنطية. وهو مؤسس التقويم الهجري.',
  },
];

var aliList = [
  {
    'name' : '	أبو الحسن علي بن أبي طالب الهاشمي القُرشي',
    'life' : '(13 رجب 23 ق هـ/17 مارس 599م - 21 رمضان 40 هـ/ 27 يناير 661 م)',
    'death_place' : 'قصر الإمارة، الكوفة (عند السنة)، النجف (عند الشيعة)',
    'notes' : 'ابن عم الرسول محمد وصهره، من آل بيته، وزوج ابنته فاطمة، وهو رابع الخلفاء الراشدين، وهو ثاني أو ثالث الناس دخولا في الإسلام، وأوّل من أسلم من الصبيان. بويع بالخلافة سنة 35 هـ (656 م) بالمدينة المنورة، وحكم خمس سنوات وثلاث أشهر، ووقعت الكثير من المعارك بسبب الفتن التي تعد امتدادا لفتنة مقتل عثمان، أولها موقعة الجمل ثم موقعة صفين، كما خرج على علي جماعة عرفوا بالخوارج وهزمهم في النهروان، وظهرت جماعات تعاديه وتتبرأ من حكمه وسياسيته سموا بالنواصب ولعل أبرزهم الخوارج. واستشهد على يد عبد الرحمن بن ملجم في رمضان سنة 40 هـ 661 م.',
  },
];

var othmanList = [
  {
    'name' : 'أبو عبد الله عثمان بن عفَّان الأموي القرشي',
    'life' : '(47 ق.هـ - 35 هـ / 576 - 656م)',
    'death_place' : 'البقيع بالمدينة المنورة',
    'notes' : 'ثالث الخلفاء الراشدين، ومن السابقين إلى الإسلام. يكنى ذا النورين لأنه تزوج اثنتين من بنات نبي الإسلام محمد، وأول مهاجر إلى أرض الحبشة. بويع عثمان بالخلافة بعد الشورى التي تمت بعد وفاة عمر بن الخطاب، وقد استمرت خلافته نحو اثني عشر عاماً. تم في عهده جمع القرآن وعمل توسعة للمسجد الحرام وكذلك المسجد النبوي، وفتحت في أيام خلافته أرمينية وخراسان وكرمان وسجستان وإفريقية وقبرص. وقد أنشأ أول أسطول بحري إسلامي. في النصف الثاني من خلافته ظهرت أحداث الفتنة التي أدت إلى استشهاده.',
  },
];

var talhaList = [
  {
    'name' : 'طَلْحَة بن عُبَيْد اللّه التَّيمي القُرشي',
    'life' : '(28 ق.هـ - 36 هـ / 594 - 656م)',
    'death_place' : 'البصرة',
    'notes' : 'هو أحد الثمانية السابقين الأولين إلى الإسلام، قال عنه الرسول محمد أنه شهيد يمشي على الأرض فقال: «من سره أن ينظر إلى شهيد يمشي على وجه الأرض فلينظر إلى طلحة بن عبيد الله». شارك في جميع الغزوات في العصر النبوي إلا غزوة بدر حيث كان بالشام، وكان ممن دافعوا عن الرسول محمد في غزوة أحد حتى شُلَّت يده، فظل كذلك إلى أن مات. وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وبعد مقتل عثمان بن عفان خرج إلى البصرة مطالبًا بالقصاص من قتلة عثمان فقُتِلَ في موقعة الجمل.',
  },
];

var awamList = [
  {
    'name' : 'الزُّبَيْرُ بن العَوَّام القرشي الأسدي',
    'life' : '(28 ق.هـ - 36 هـ / 594 - 656م)',
    'death_place' : 'البصرة',
    'notes' : 'ابن عمة نبي الإسلام محمد بن عبد الله، وأحد الثمانية السابقين إلى الإسلام، يُلقب بـ حواري رسول الله؛ لأن النبي قال عنه: «إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًا، وَحَوَارِيَّ الزُّبَيْرُ»، أوَّل من سلَّ سيفه في الإسلام، وهو أبو عبد الله بن الزبير الذي بُويع بالخلافة ولكن خلافته لم تمكث طويلًا، وزوج أسماء بنت أبي بكر المُلقّبة بذات النطاقين. شارك في جميع الغزوات في العصر النبوي، وشارك في فتح مصر، وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وبعد مقتل عثمان بن عفان خرج إلى البصرة مطالبًا بالقصاص من قتلة عثمان فقَتَله عمرو بن جرموز في موقعة الجمل،',
  },
];

var aofList = [
  {
    'name' : 'عبد الرّحمن بن عوف القرشيّ الزهريّ',
    'life' : '(43 ق هـ - 32 هـ / 580 - 656م)',
    'death_place' : 'البقيع بالمدينة المنورة',
    'notes' : 'هو أحد الثمانية الذين سبقوا بالإسلام، كان اسمه في الجاهلية عبد عمرو، وقيل عبد الكعبة، فسماه النبي عبد الرحمن. شارك في جميع الغزوات في العصر النبوي، وأرسله النبي على سرية إلى دومة الجندل، وصلى النبي محمد وراءه في إحدى الغزوات، وكان عمر بن الخطاب يستشيره، وجعله عمر في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وكان عبد الرحمن تاجرًا ثريًا وكريمًا.',
  },
];

var saadList = [
  {
    'name' : 'سَعْد بن أَبي وقاص مَالِك القرشي الزهري',
    'life' : '(23 ق هـ أو 27 ق هـ - 55 هـ / 595 أو 599 - 674م)',
    'death_place' : 'البقيع بالمدينة المنورة',
    'notes' : 'أحد الثمانية السابقين الأولين إلى الإسلام، وهو أوّل من رمى بسهمٍ في سبيل الله، وقال له النبي: «ارم فداك أبي وأمي»، وهو من أخوال النبي، شهد المشاهد كلها مع النبي، وكان من الرماة الماهرين، استعمله عمر بن الخطاب على الجيوش التي سَيَّرها لقتال الفرس، وفانتصر عليهم في معركة القادسية، وأَرسل جيشًا لقتال الفرس بجلولاء فهزموهم، وهو الذي فتح مدائن كسرى بالعراق. فكان من قادة الفتح الإسلامي لفارس، وكان أول ولاة الكوفة، حيث قام بإنشائها بأمر من عمر سنة 17 هـ، وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، اعتزل سعد الفتنة بين علي ومعاوية، وكان آخر المهاجرين وفاةً.',
  },
];

var sayedList = [
  {
    'name' : 'سَعِيد بن زَيْد القرشي العدوي',
    'life' : '(22 ق.هـ - 51 هـ / 600 - 671م)',
    'death_place' : 'العقيق بالمدينة المنورة',
    'notes' : 'أحد السابقين الأولين إلى الإسلام، حيث أسلم بعد ثلاثة عشر رجلًا، كان أبوه زيد من الأحناف في الجاهلية؛ فلا يعبد إلا الله ولا يسجد للأصنام، وهو ابن عم عمر بن الخطاب، وأخته عاتكة بنت زيد زوجة عمر، وزوجته هي أخت عمر فاطمة بنت الخطاب والتي كانت سببًا في إسلام عمر بن الخطاب. شهد سعيد المشاهد كلها مع النبي إلا غزوة بدر، شهد معركة اليرموك، وحصار دمشق وفتحها، وولاه عليها أبو عبيدة بن الجراح، فكان أول من عمل نيابة دمشق من المسلمين.',
  },
];

var garahList = [
  {
    'name' : 'أبو عبيدة عامر بن عبد الله بن الجراح الفهري القرشي',
    'life' : '(40 ق هـ/584م - 18هـ/639م)',
    'death_place' : 'غور الأردن',
    'notes' : 'أحد الثمانية السابقين الأولين إلى الإسلام، لقَّبَهُ النّبيُّ محمدٌ بأمين الأمة حيث قال: «إن لكل أمّة أميناً، وإن أميننا أيتها الأمة: أبو عبيدة بن الجراح». شهد مع الرسول محمد غزوة بدر والمشاهد كلها، وكان أبو عبيدة أحد القادة الأربعة الذين عيَّنهم أبو بكر لفتح بلاد الشام، ولما ولي عمر بن الخطاب الخلافةَ عَزَلَ خالداً بنَ الوليد، واستعمل أبا عبيدة، وقد نجح أبو عبيدة في فتح دمشق وغيرِها من مُدُنِ الشامِ وقُراها. وفي عام 18هـ الموافق 639م توفي أبو عبيدة بسبب طاعون عمواس في غور الأردن ودُفن فيه.',
  },
];